---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.PropertyNotClosed
source: html/b5068d1e-a2fe-b4d2-f4c0-23ee16ee9f09.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.PropertyNotClosed Property

Property lines do not form a closed loop. Area will not be computed.

## Syntax (C#)
```csharp
public static FailureDefinitionId PropertyNotClosed { get; }
```